function rest_of_first_page(doc, pageWidth, const1, const2, y = 20.4) {
    doc.setFont('THSarabunNew', 'bold')
    doc.text('เรียน', 2, y)
    doc.setFont('THSarabunNew', 'normal')
    doc.text('คณบดีคณะวิศวกรรมศาสตร์ ผ่านหัวหน้าเจ้าหน้าที่', 2.8, y)
    y += 0.6;
    doc.text('จึงเรียนมาเพื่อโปรดพิจารณาและขออนุมัติ', 3.5, y)
    y += 0.6;
    doc.text('1. ขออนุมัติดำเนินการจัดซื้อ/จัดจ้างพัสดุดังกล่าวและขอความเห็นชอบให้จัดทำรายงานขอซื้อขอจ้างในระบบ e-GP', 3.5, y);
    y += 0.6;
    doc.text('2. ขอความเห็นชอบลงนามในคำสั่งแต่งตั้งผู้รับผิดชอบและหรือคณะกรรมการการกำหนดรายละเอียดคุณลักษณะเฉพาะ', 3.5, y);
    y += 0.6;
    doc.text('พัสดุหรือขอบเขตของงาน และขอความเห็นชอบรายชื่อผู้ตรวจรับพัสดุหรือคณะกรรมการตรวจรับพัสดุดังกล่าวข้างต้น', 2, y);
    y += 0.6;
    doc.text('3. ขอความเห็นชอบรายละเอียดคุณลักษณะเฉพาะของพัสดุหรือขอบเขตของงานจ้างรวมทั้งการกำหนดราคากลางของ', 3.5, y);
    y += 0.6;
    doc.text('พัสดุที่จะซื้อ/จ้างดังกล่าวและขออนุมัติให้ดำเนินการตามหลักเกณฑ์การเปิดเผยราคากลางและการคำนวณราคากลางของกรมบัญชีกลาง', 2, y);
    y += 0.6;
    doc.text('แบบ บก.06', 2, y);
    doc.text('4. ขอความเห็นชอบ เนื่องจากการจัดซื้อจัดจ้างในครั้งนี้ เจ้าหน้าที่ของหน่วยงาน/เจ้าของงบประมาณโครงการ/', 3.5, y);
    y += 0.6;
    doc.text('ผู้รับผิดชอบโครงการ/ผู้รับผิดชอบโครงงานวิจัย โดย ........................................................ ได้ดำเนินการเป็นผู้เจรจาหรือตกลงราคากับ', 2, y);
    y += 0.6;
    doc.text('(ผู้ขาย/ผู้รับจ้าง) โดยตรงแล้ว ในส่วนของเจ้าหน้าที่พัสดุได้ดำเนินการจัดทำหน้าที่เฉพาะในส่วนการจัดทำเอกสารจัดซื้อจัดจ้างลงในระบบ', 2, y);
    y += 0.6;
    doc.text('e-GP เท่านั้น ฉะนั้น การจัดซื้อจัดจ้างโครงการ/โครงงานวิจัยดังกล่าวนั้น เจ้าหน้าที่พัสดุจึงมิได้ปฏิบัติหน้าที่ตามระเบียบ ข้อ 79 วรรคหนึ่ง', 2, y);
    y += 0.6;
    doc.text('แต่อย่างใด', 2, y);
    y += 0.6;
    signature_box2(doc, pageWidth, const1, const2, y);

}
